; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v6 ?v4)
             (pred_10 ?v9 ?v12)
             (pred_11 ?v6 ?v12)
             (pred_2 ?v10 ?v6 )
	     (pred_7 ?v6)
             (pred_9 ?v13)
             (pred_3 ?v9)
             (pred_12 ?v12)
             (pred_4 ?v6)
             (pred_8 ?v9)
             (pred_6 ?v6)
             (pred_5 ))



(:action op_5
:parameters (?v8 ?v5 ?v7 ?v11)
:precondition (and (pred_9 ?v8) (pred_9 ?v5) (pred_3 ?v7) (pred_12 ?v11)
          (pred_1 ?v8 ?v5) (pred_10 ?v7 ?v11)
                   (pred_11 ?v5 ?v11) (pred_7 ?v8) 
                   (pred_4 ?v5) (pred_8 ?v7))
:effect (and  (pred_6 ?v5) (not (pred_4 ?v5))))


(:action op_3
:parameters (?v8 ?v3)
:precondition (and (pred_9 ?v8) (pred_9 ?v3)
               (pred_7 ?v8) (pred_1 ?v8 ?v3) (pred_6 ?v3))
:effect (and (pred_7 ?v3) (not (pred_7 ?v8))))

(:action op_1
:parameters (?v8 ?v7)
:precondition (and (pred_9 ?v8) (pred_3 ?v7) 
                  (pred_7 ?v8) (pred_2 ?v7 ?v8) (pred_5 ))
:effect (and (pred_8 ?v7)
   (not (pred_2 ?v7 ?v8)) (not (pred_5 ))))


(:action op_2
:parameters (?v8 ?v1 ?v2)
:precondition (and (pred_9 ?v8) (pred_3 ?v1) (pred_3 ?v2)
                  (pred_7 ?v8) (pred_8 ?v2) (pred_2 ?v1 ?v8))
:effect (and (pred_8 ?v1) (pred_2 ?v2 ?v8)
        (not (pred_8 ?v2)) (not (pred_2 ?v1 ?v8))))

(:action op_4
:parameters (?v8 ?v7)
:precondition (and (pred_9 ?v8) (pred_3 ?v7) 
                  (pred_7 ?v8) (pred_8 ?v7))
:effect (and (pred_5 ) (pred_2 ?v7 ?v8) (not (pred_8 ?v7)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_11 obj_09 obj_15 obj_20 obj_14 obj_16 obj_18 obj_12 obj_04 obj_02 obj_03 obj_06 obj_19 obj_08 obj_05
    obj_13 obj_17
    obj_10 obj_01
    )

    (:init
       (pred_5)

       (pred_9 obj_07)
       (pred_9 obj_11)
       (pred_9 obj_09)
       (pred_9 obj_15)
       (pred_9 obj_20)
       (pred_9 obj_14)
       (pred_9 obj_16)
       (pred_9 obj_18)
       (pred_9 obj_12)
       (pred_9 obj_04)
       (pred_9 obj_02)
       (pred_9 obj_03)
       (pred_9 obj_06)
       (pred_9 obj_19)
       (pred_9 obj_08)
       (pred_9 obj_05)
       (pred_12 obj_13)
       (pred_12 obj_17)
       (pred_3 obj_10)
       (pred_3 obj_01)

       (pred_1 obj_07 obj_20)
       (pred_1 obj_07 obj_11)
       (pred_1 obj_11 obj_14)
       (pred_1 obj_11 obj_09)
       (pred_1 obj_11 obj_07)
       (pred_1 obj_09 obj_16)
       (pred_1 obj_09 obj_15)
       (pred_1 obj_09 obj_11)
       (pred_1 obj_15 obj_18)
       (pred_1 obj_15 obj_09)
       (pred_1 obj_20 obj_12)
       (pred_1 obj_20 obj_14)
       (pred_1 obj_20 obj_07)
       (pred_1 obj_14 obj_04)
       (pred_1 obj_14 obj_16)
       (pred_1 obj_14 obj_11)
       (pred_1 obj_14 obj_20)
       (pred_1 obj_16 obj_02)
       (pred_1 obj_16 obj_18)
       (pred_1 obj_16 obj_09)
       (pred_1 obj_16 obj_14)
       (pred_1 obj_18 obj_03)
       (pred_1 obj_18 obj_15)
       (pred_1 obj_18 obj_16)
       (pred_1 obj_12 obj_06)
       (pred_1 obj_12 obj_04)
       (pred_1 obj_12 obj_20)
       (pred_1 obj_04 obj_19)
       (pred_1 obj_04 obj_02)
       (pred_1 obj_04 obj_14)
       (pred_1 obj_04 obj_12)
       (pred_1 obj_02 obj_08)
       (pred_1 obj_02 obj_03)
       (pred_1 obj_02 obj_16)
       (pred_1 obj_02 obj_04)
       (pred_1 obj_03 obj_05)
       (pred_1 obj_03 obj_18)
       (pred_1 obj_03 obj_02)
       (pred_1 obj_06 obj_19)
       (pred_1 obj_06 obj_12)
       (pred_1 obj_19 obj_08)
       (pred_1 obj_19 obj_04)
       (pred_1 obj_19 obj_06)
       (pred_1 obj_08 obj_05)
       (pred_1 obj_08 obj_02)
       (pred_1 obj_08 obj_19)
       (pred_1 obj_05 obj_03)
       (pred_1 obj_05 obj_08)
       (pred_4 obj_04)
       (pred_4 obj_08)
       (pred_11  obj_04 obj_13)
       (pred_11  obj_08 obj_17)
       (pred_6 obj_07)
       (pred_6 obj_11)
       (pred_6 obj_09)
       (pred_6 obj_15)
       (pred_6 obj_20)
       (pred_6 obj_14)
       (pred_6 obj_16)
       (pred_6 obj_18)
       (pred_6 obj_12)
       (pred_6 obj_02)
       (pred_6 obj_03)
       (pred_6 obj_06)
       (pred_6 obj_19)
       (pred_6 obj_05)

       (pred_10  obj_10 obj_13)
       (pred_10  obj_01 obj_17)
       (pred_2 obj_10 obj_02)
       (pred_2 obj_01 obj_20)
       (pred_7 obj_12)
    )

    (:goal (and
       (pred_2 obj_10 obj_03)
    ))
(:constraints
  (always (not (pred_7 obj_16)))
)
)

; plan
1. (op_3 obj_12 obj_20)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_20)
   goals met: 0 of 1
2. (op_3 obj_20 obj_14)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_14)
   goals met: 0 of 1
3. (op_3 obj_14 obj_11)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_11)
   goals met: 0 of 1
4. (op_3 obj_11 obj_09)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_09)
   goals met: 0 of 1
5. (op_3 obj_09 obj_15)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_15)
   goals met: 0 of 1
6. (op_3 obj_15 obj_18)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_18)
   goals met: 0 of 1
7. (op_3 obj_18 obj_03)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_03)
   goals met: 0 of 1
8. (op_3 obj_03 obj_02)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_02)
   goals met: 0 of 1
9. (op_1 obj_02 obj_10)
   deleted: (pred_2 obj_10 obj_02) (pred_5)
   added: (pred_8 obj_10)
   goals met: 0 of 1
10. (op_3 obj_02 obj_03)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_03)
   goals met: 0 of 1
11. (op_4 obj_03 obj_10)
   deleted: (pred_8 obj_10)
   added: (pred_5) (pred_2 obj_10 obj_03)
   goals met: 1 of 1
